app/controllers/farms_controller.rb

SELECT "farms".* FROM "farms"
---
  def index
    @farms = Farm.all

INSERT INTO "farms" ("size", "location", "irrigation", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["size", 5.0], ["location", "Rayagada"], ["irrigation", "Canal"], ["created_at", "2017-11-02 01:25:14.620231"], ["updated_at", "2017-11-02 01:25:14.620231"]]
---
  def create
    @farm = Farm.new(farm_params)

    respond_to do |format|
      if @farm.save

UPDATE "farms" SET "size" = ?, "updated_at" = ? WHERE "farms"."id" = ?  [["size", 4.0], ["updated_at", "2017-12-01 03:37:55.975465"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @farm.update(farm_params)

DELETE FROM "farms" WHERE "farms"."id" = ?  [["id", 3]]
---
  def destroy
    @farm.destroy

SELECT  "farms".* FROM "farms" WHERE "farms"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def set_farm
      @farm = Farm.find(params[:id])